# ============================================================
# Brewfile — managed by chezmoi
# Install everything: brew bundle
# ============================================================

# ---- Taps ----
tap "alienator88/cask"
tap "anomalyco/tap"
tap "charmbracelet/tap"
tap "danvergara/tools"
tap "dldash/core"
tap "dotenvx/brew"
tap "felixkratz/formulae"
tap "grishka/grishka"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "koekeishiya/formulae"
tap "localsend/localsend"
tap "mongodb/brew"
tap "mrkai77/cask"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "playcover/playcover"
tap "schappim/ocr"
tap "sst/tap"
tap "tokuhirom/tap"
tap "tw93/tap"

# ---- Shell & Terminal ----
brew "fish"
brew "starship"
brew "tmux"
brew "zellij"
brew "zoxide"
brew "fzf"

# ---- CLI Essentials ----
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "jq"
brew "sd"
brew "tree"
brew "wget"
brew "coreutils"
brew "glow"
brew "yazi"
brew "tlrc"
brew "tokei"
brew "cloc"
brew "dua-cli"
brew "bandwhich"
brew "fastfetch"
brew "neofetch"
brew "htop"
brew "btop"
brew "mas"

# ---- Git ----
brew "git"
brew "git-delta"
brew "git-lfs"
brew "lazygit"
brew "gh"
brew "glab"
brew "diff-so-fancy"
brew "gitmoji"
brew "czg"
brew "tig"

# ---- Docker & Containers ----
brew "lazydocker"
brew "podman"
brew "minikube"
brew "kubernetes-cli"

# ---- Languages & Runtimes ----
# Node
brew "fnm"
brew "node"
brew "pnpm"
brew "yarn"
brew "oven-sh/bun/bun"

# Python
brew "pyenv"
brew "pyenv-virtualenv"
brew "pipx"
brew "uv"

# Go
brew "go"
brew "golang-migrate"

# Ruby
brew "chruby"
brew "ruby-install"

# PHP
brew "php"
brew "composer"

# Rust (managed via rustup)

# Other
brew "gleam"
brew "zig"

# ---- Editors ----
brew "neovim"
brew "helix"

# ---- Cloud & DevOps ----
brew "awscli"
brew "doctl"
brew "firebase-cli"
brew "railway"
brew "tfenv"
brew "localstack"
brew "dotenvx/brew/dotenvx"

# ---- Security ----
brew "gnupg"
brew "pinentry"
brew "pinentry-mac"
brew "pass"
brew "openvpn"
brew "nmap"
brew "rustscan"
brew "wireshark"
brew "sshpass"

# ---- AI & LLM Tools ----
brew "ollama"
brew "hf"
brew "gemini-cli"
brew "anomalyco/tap/opencode"
brew "charmbracelet/tap/crush"

# ---- Media & Files ----
brew "ffmpeg"
brew "imagemagick"
brew "poppler"

# ---- Misc Dev Tools ----
brew "chezmoi"
brew "ansible"
brew "just"
brew "watchman"
brew "telnet"
brew "netcat"
brew "iproute2mac"
brew "jj"
brew "hugo"
brew "zola"
brew "nginx"
brew "biome"
brew "xxh"
brew "codex"
brew "tw93/tap/mole"
brew "tokuhirom/tap/dcv"

# ---- Spicetify ----
brew "spicetify-cli", link: false

# ---- Tailscale ----
brew "tailscale", link: false

# ============================================================
# Casks (GUI Apps)
# ============================================================

# ---- Terminals & Editors ----
cask "ghostty"
cask "zed"
cask "visual-studio-code"

# ---- Browsers ----
cask "brave-browser"
cask "vivaldi"

# ---- Productivity ----
cask "raycast"
cask "obsidian"
cask "bartender"
cask "scroll-reverser"
cask "shottr"

# ---- System Utilities ----
cask "betterdisplay"
cask "batfi"
cask "hot"
cask "grandperspective"
cask "loop"
cask "tailscale-app"

# ---- Security ----
cask "gpg-suite-no-mail"
cask "git-credential-manager"
cask "knockknock"
cask "lulu"
cask "netiquette"

# ---- Remote & Communication ----
cask "anydesk"
cask "rustdesk"
cask "zoom"
cask "microsoft-teams"
cask "microsoft-auto-update"

# ---- Dev Tools ----
cask "orbstack"
cask "gcloud-cli"
cask "dotnet-sdk"
cask "flutter"
cask "yaak"
cask "cap"
cask "obs"

# ---- Fonts ----
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-fira-code"
cask "font-geist-mono"
cask "font-hack"
cask "font-zed-mono-nerd-font"

# ---- Java ----
cask "zulu@11"

# ============================================================
# Mac App Store
# ============================================================
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 361309726
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "RunCat", id: 1429033973
mas "The Unarchiver", id: 425424353
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835

# ============================================================
# VSCode Extensions
# ============================================================
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dsznajder.es7-react-js-snippets"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "vscodevim.vim"

# ============================================================
# Go tools (installed via `go install`)
# ============================================================
go "github.com/air-verse/air"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "github.com/hhatto/gocloc/cmd/gocloc"
go "github.com/joho/godotenv/cmd/godotenv"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abice1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/supakornn/goscanner"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/supakornn/hexagonal-go"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "go.uber.org/mock/mockgen"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/kyoh86/richgo"
go "honnef.co/go/tools/cmd/staticcheck"

# ============================================================
# Cargo tools (installed via `cargo install`)
# ============================================================
cargo "cargo-release"
cargo "codeberg-cli"
cargo "live-server"
cargo "myip-tui"
cargo "nanorust"
cargo "rustscan"

# ============================================================
# uv tools
# ============================================================
uv "specify-cli"
