# ============================================================
# Brewfile — managed by chezmoi
# Install everything: brew bundle
# ============================================================

# ---- Taps ----
tap "anomalyco/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
tap "mrkai77/cask"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "tw93/tap"

# ---- Shell & Terminal ----
brew "fish"
brew "starship"
brew "tmux"
brew "zoxide"
brew "fzf"

# ---- CLI Essentials ----
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "jq"
brew "sd"
brew "tree"
brew "wget"
brew "coreutils"
brew "yazi"
brew "tlrc"
brew "tokei"
brew "dua-cli"
brew "fastfetch"
brew "btop"
brew "mas"

# ---- Git ----
brew "git"
brew "git-delta"
brew "git-lfs"
brew "lazygit"
brew "gh"
brew "glab"
brew "diff-so-fancy"
brew "gitmoji"
brew "czg"

# ---- Docker & Containers ----
brew "podman"
brew "minikube"
brew "kubernetes-cli"

# ---- Languages & Runtimes ----
# Node
brew "fnm"
brew "node"
brew "pnpm"
brew "yarn"
brew "oven-sh/bun/bun"

# Python
brew "pyenv"
brew "uv"

# Go
brew "go"
brew "golang-migrate"

# Ruby
brew "chruby"
brew "ruby-install"

# Rust (managed via rustup)

# Other
brew "gleam"
brew "zig"

# ---- Editors ----
brew "neovim"

# ---- Cloud & DevOps ----
brew "awscli"
brew "doctl"
brew "railway"
brew "tfenv"
brew "localstack"

# ---- Security ----
brew "gnupg"
brew "pinentry-mac"
brew "openvpn"

# ---- AI & LLM Tools ----
brew "ollama"
brew "hf"
brew "gemini-cli"
brew "anomalyco/tap/opencode"

# ---- Media & Files ----
brew "ffmpeg"
brew "imagemagick"
brew "poppler"

# ---- Misc Dev Tools ----
brew "chezmoi"
brew "just"
brew "watchman"
brew "netcat"
brew "jj"
brew "nginx"
brew "biome"
brew "tw93/tap/mole"

# ---- Spicetify ----
brew "spicetify-cli", link: false

# ---- Tailscale ----
brew "tailscale", link: false

# ============================================================
# Casks (GUI Apps)
# ============================================================

# ---- Terminals & Editors ----
cask "ghostty"
cask "zed"
cask "visual-studio-code"

# ---- JetBrains ----
cask "jetbrains-toolbox"

# ---- Browsers ----
cask "brave-browser"

# ---- Productivity ----
cask "raycast"
cask "obsidian"
cask "bartender"
cask "scroll-reverser"
cask "shottr"

# ---- System Utilities ----
cask "betterdisplay"
cask "batfi"
cask "hot"
cask "grandperspective"
cask "loop"
cask "tailscale-app"

# ---- Security ----
cask "git-credential-manager"
cask "knockknock"
cask "lulu"
cask "netiquette"

# ---- Remote & Communication ----
cask "anydesk"
cask "rustdesk"
cask "zoom"
cask "microsoft-teams"
cask "microsoft-auto-update"

# ---- Dev Tools ----
cask "orbstack"
cask "gcloud-cli"
cask "dotnet-sdk"
cask "flutter"
cask "yaak"
cask "cap"
cask "obs"

# ---- Fonts ----
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"

# ---- Java ----
cask "zulu@11"
